Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: The scope of the package declaration is either the supplied code BLOCK or, in the absence of a BLOCK, from the declaration itself through the end of current scope (the enclosing block, file, or C<eval>).
es_es: El alcance de la declaración del paquete es, tanto el BLOQUE indicado o, en ausencia de un BLOQUE, desde la misma declaración hasta el final del ámbito actual (el bloque, archivo o C<eval> que lo engloba).

source: If EXPR is omitted, takes the cosine of C<$_>.
es_es: Si EXPR se omite, devuelve el coseno de C<$_>.

source: gt greater than
es_es: gt mayor que

source: The only things you need to declare in Perl are report formats and subroutines (and sometimes not even subroutines).
es_es: Los únicos elementos que necesita declarar en Perl son los informes y las subrutinas (y algunas veces ni siquiera las subrutinas).

source: \U uppercase till \E (think vi)
es_es: \U pasar a mayúscula hasta \E (como en vi)

source: } else { # in body # do something else
es_es: } else { # en cuerpo # hacer otra cosa

source: The function returns a packed string representing the requested socket option, or C<undef> on error, with the reason for the error placed in C<$!>.
es_es: La llamada devuelve una cadena empaquetada representando la opción socket solicitada, o C<undef> si hay un error, con la razón del error puesta en C<$!>.

source: The length of ARRAY increases by the length of LIST.
es_es: La longitud de ARRAY se incrementa por la misma cantidad que la longitud de LISTA.

source: See L<perlrebackslash/Misc> for details.
es_es: Vea L<perlrebackslash/Miscelánea> para más detalles.

# print "j p " ^ " a h"; # prints "JAPH "
source: print "j p \n" ^ " a h"; # prints "JAPH\n"
es_es: print "j p \n" ^ " a h"; # imprime "JAPH\n"

source: =head2 Support for C<configure_requires> in CPAN module metadata
es_es: =head2 Suporte para C<configure_requires> en el módulo de CPAN metadata

source: If EXPR is omitted, gives C<exp($_)>.
es_es: Si EXPR se omite, devuelve C<exp($_)>.

source: Setting C<O_CREAT|O_EXCL> prevents the file from being opened if it is a symbolic link.
es_es: Estableciendo C<O_CREAT|O_EXCL> impide que el archivo sea abierto si es un enlace simbólico.

source: Previously while the order of hash elements from keys(), values(), and each() was essentially random, it was still repeatable.
es_es: Anteriormente, mientras que el orden de los elementos de un hash obtenidos mediante keys(), values() y each() era, esencialmente, aleatorio, seguía siendo replicable.

source: =item printf FILEHANDLE
es_es: =item printf IDENTIFICADOR_ARCHIVO

source: print ++($foo = "99"); # prints "100"
es_es: print ++($foo = "99"); # imprime "100"

source: # or for GMT formatted appropriately for your locale:
es_es: # o para GMT formateado a su región:

source: =head2 UTF-8 no longer default under UTF-8 locales
es_es: =head2 UTF-8 ya no está por defecto bajo la configuración regional de UTF-8

source: [ "fred", "barney", "pebbles", "bambam", "dino", ],
es_es: [ "pedro", "pablo", "pebbles", "bambam", "dino", ],

source: >> 8; # child exit status
es_es: >> 8; # estado de salida del hijo

source: open(STDERR, ">&STDOUT") or die "Can't dup STDOUT: $!";
es_es: open(STDERR, ">&STDOUT") or die "No puedo duplicar STDOUT: $!";

source: If you specify C<< '<&=X' >>, where C<X> is a file descriptor number or a filehandle, then Perl will do an equivalent of C's C<fdopen> of that file descriptor (and not call C<dup(2)>); this is more parsimonious of file descriptors.
es_es: Si especifica C<< '<&=X' >>, donde C<X> es un número de descriptor de archivo o un identificador de archivo, entonces Perl hará un equivalente de C de C<fdopen> de ese descriptor de archivo (y no llamar a C<dup(2)>).

source: \R [4] Linebreak
es_es: \R [4] Ruptura de línea

source: SCALAR this
es_es: SCALAR este

source: ISBN 978-0-596-00639-6 [2nd edition May 2009]
es_es: ISBN 978-0-596-00639-6 [2ª edición - Mayo de 2009]

source: Same as C<S{0,1}?>, C<S{0,BIG_NUMBER}?>, C<S{1,BIG_NUMBER}?> respectively.
es_es: Lo mismo que C<S{0,1}?>, C<S{0,BIG_NUMBER}?>, C<S{1,BIG_NUMBER}?> respectivamente.

source: print(" line-noise"), redo LOOP if /\G\W+/gc;
es_es: print(" línea-ruido"), redo LOOP if /\G\W+/gc;

source: By default, all filehandles operate on bytes, but for example if the filehandle has been opened with the C<:utf8> I/O layer (see L</open>, and the C<open> pragma, L<open>), the I/O will operate on UTF8-encoded Unicode characters, not bytes.
es_es: Por defecto, todos los identificadores de archivo operan en bytes, pero por ejemplo, si el identificador ha sido abierto con la capa de E/S C<:utf8> (vea L</open>, y el pragma C<open>, L<open>), la E/S operará en caracteres codificados en UTF-8, no bytes.

source: No interpolation is performed.
es_es: No se realiza ninguna interpolación.

source: VERSION must be a "strict" style version number as defined by the L<version> module: a positive decimal number (integer or decimal-fraction) without exponentiation or else a dotted-decimal v-string with a leading 'v' character and at least three components.
es_es: VERSIÓN debe ser un número de versión al estilo "estricto", según lo define el módulo L<version>: un número decimal positivo (entero o decimal) sin exponentes o una v-cadena con una 'v' precedente con al menos tres componentes.

source: $line .= <ARGV>;
es_es: $linea .= <ARGV>;

source: # or ./Configure -de -Dusedevel
es_es: # o ./Configure -de -Dusedevel

source: You cannot read() (or sysread()) from a closed or unopened filehandle.
es_es: No se puede read() (o sysread()) de un identificador de archivo cerrado o no abierto.

source: We assume ANSI C89 plus the following: - <stddef.h>, <stdlib.h> - rename() - opendir(), readdir(), closedir() (via dirent.h) - memchr(), memcmp(), memcpy(), memset() (via string.h) - (a safe) putenv() (via stdlib.h) - strtoul() (via stdlib.h) (grep for 'define' in uconfig.sh.) Also, Perl times() is defined to always return zeroes.
es_es: Asumimos ANSI C89 más lo siguiente: - <stddef.h>, <stdlib.h> - rename() - opendir(), readdir(), closedir() (vía dirent.h) - memchr(), memcmp(), memcpy(), memset() (vía string.h) - (un seguro) putenv() (vía stdlib.h) - strtoul() (vía stdlib.h) (grep para 'define' en uconfig.sh.) También, Perl times() está definido para devolver siempre ceros.

source: However, when it's a list-context assignment and you're trying to use C<||> for control flow, you probably need "or" so that the assignment takes higher precedence.
es_es: Sin embargo, cuando se trata de una asignación en contexto de lista y usted está tratando de usar "||" para el control de flujo, es probable que necesite usar "or" para que la asignación tenga la mayor precedencia.

source: $foo = 150 | 105; # yields 255 (0x96 | 0x69 is 0xFF)
es_es: $foo = 150 | 105; # produce 255 (0x96 | 0x69 es 0xFF)

source: In list context, reads until end-of-file is reached and returns a list of lines.
es_es: En contexto de lista, lee hasta el final de archivo y devuelve una lista de líneas.

source: The implementation provides a cache, in which you can store a single C<SV *>, or anything that can be cast to C<SV *>, such as C<AV *>.
es_es: La implementación proporciona una memoria caché, en el que puede almacenar un único C<SV *>, o cualquier cosa que se puede convertir a C<SV *>, como un C<AV *>.

source: This function calls the underlying operating system's I<open>(2) function with the parameters FILENAME, MODE, and PERMS.
es_es: Esta función llama a la función subyacente del sistema operativo I<open>(2) con los parámetros ARCHIVO, MODO y PERMISOS.

source: Beginning is <I have 2 numbers: 53147>, number is <>.
es_es: El comienzo es <Tengo 2 números: 53147>, número es <>.

source: The final section, "Common Pitfalls", describes some of the most popular mistakes made by CPAN authors.
es_es: La sección final, "Errores comunes", describe algunos de los errores más populares hechas por los autores de CPAN.

source: This is now fixed [RT #50256].
es_es: Esto ha sido arreglado [RT #50256].

source: Parsing of the bracketed character class construct, C<[...]>, is rather different than the rule used for the rest of the pattern.
es_es: El análisis de la construcción clase de caracteres, entre corchetes, C<[...]>, es bastante diferente a la regla utilizada para el resto del patrón.

source: spicy tomato
es_es: tomate especiado

source: That will efficiently match a nonempty group with matching parentheses two levels deep or less.
es_es: Coincidirá, de manera eficiente, con un grupo no vacío de parejas de paréntesis anidados a dos niveles o menos.

source: The ordering is the same as for the regular expression which is the result of EXPR, or the pattern contained by capture group PARNO.
es_es: El orden es el mismo que para la expresión regular que sea el resultado de EXPR, o el patrón capturado en el grupo de captura PARNO.

source: The transliteration operator.
es_es: El operador de transliteración.

source: perlnumber - semantics of numbers and numeric operations in Perl
es_es: perlnumber - Semántica de números y operaciones numéricas en Perl

source: The pattern C</PATTERN/> may be replaced with an expression to specify patterns that vary at runtime.
es_es: El patrón C</PATRÓN/> puede ser sustituido por una expresión para especificar patrones que varían en tiempo de ejecución.

source: =item shmread ID,VAR,POS,SIZE X<shmread> X<shmwrite>
es_es: =item shmread ID,VAR,POSICIÓN,TAMAÑO X<shmread> X<shmwrite>

source: See L<perlipc/"UDP: Message Passing"> for examples.
es_es: Ver L<perlipc/"UDP: Paso de mensajes"> para ejemplos.

source: If PATTERN is also omitted, splits on whitespace (after skipping any leading whitespace).
es_es: Si PATRÓN es también omitido, se divide por el espacio en blanco(después de saltarse cualquier espacio en blanco precedente).

source: With the C<base> pragma, an intermediate class with no fields used to messes up private fields in the base class.
es_es: Con el pragma C<base>, una clase intermedia sin campos es utilizada para mezclarse con los campos privados de la clase base.

source: (If it's text data.)
es_es: (si son datos de tipo texto).

source: Multi-number v-strings like C<v65.66> and C<65.66.67> continue to be v-strings always.
es_es: V-strings multi números como C<v65.66> y C<65.66.67> siguen siendo v-strings.

source: open(STDERR, ">&OLDERR") or die "Can't dup OLDERR: $!";
es_es: open(STDERR, ">&OLDERR") or die "No puedo duplicar OLDERR: $!";

source: printf '<%+10.6d>', 1; # prints "< +000001>"
es_es: printf '<%+10.6d>', 1; # imprime "< +000001>"

source: Perl also has its own built-in variables whose names don't follow these rules.
es_es: Perl también tiene su propias variables incorporadas cuyos nombres no siguen estas reglas.

source: The Perl build system starts with the F<Configure> script in the root directory.
es_es: El sistema de compilación de Perl empieza por el script F<Configure> del directorio raíz.

source: If you haven't used regular expressions before, a quick-start introduction is available in L<perlrequick>, and a longer tutorial introduction is available in L<perlretut>.
es_es: Si no ha utilizado expresiones regulares antes, una introducción rápida está disponible en L<perlrequick>, y un cursillo de introducción mayor está disponible en L<perlretut>.

source: Now we can use the subroutine just as any other built-in function:
es_es: Ahora podemos usar la subrutina como cualquier función integrada:

source: (See setpriority(2).) Raises an exception when used on a machine that doesn't implement setpriority(2).
es_es: (Ver setpriority(2)). Lanza una excepción cuando se utiliza en una máquina que no implementa setpriority(2).

source: open(FOO, "cat -n '$file'|");
es_es: open(FOO, "cat -n '$archivo'|");

source: =head2 Special Backtracking Control Verbs
es_es: =head2 Verbos especiales para el control de la vuelta atrás

source: You can also gain some minuscule measure of efficiency by pre-extending an array that is going to get big.
es_es: También se puede ganar una minúscula cantidad de eficiencia pre-extendiendo un array que va a hacerse grande.

source: If the actual argument was negative, Perl would call FETCHSIZE implicitly and add the result to the index before passing the result to the tied array method.
es_es: Si el argumento era negativo, Perl llamaría a FETCHSIZE de forma implícita y sumaría el resultado al índice antes de pasar el resultado al método de array enlazado.

source: 6 rdev the device identifier (special files only)
es_es: 6 rdev identificador del dispositivo (solo archivos especiales)

source: =item C<(?adluimsx-imsx:pattern)>
es_es: =item C<(?adluimsx-imsx:patrón)>

source: See L<perlop/"Bitwise String Operators">.
es_es: Ver L<perlop/"Operadores de bit en cadenas"> .

source: Printing to a closed pipe or socket will generate a SIGPIPE signal.
es_es: Imprimir a una tubería o socket cerrados generará una señal SIGPIPE.

source: It is also Perl's exception-trapping mechanism, where the die operator is used to raise exceptions.
es_es: También es el mecanismo de captura de excepciones, donde el operador die se usa para levantar excepciones.

source: There are some cases where Perl can't immediately tell the difference between an expression and a statement.
es_es: Hay algunos casos donde Perl no puede decir, de forma inmediata, la diferencia entre una expresión y una instrucción.

source: Therefore C<<<EOF> is terminated by C<EOF> immediately followed by C<"\n"> and starting from the first column of the terminating line.
es_es: Por lo tanto C<<<EOF> es terminado por un C<EOF> inmediatamente seguido por un C<"\n"> y empezando en la primera columna de la línea de terminación.

source: when ([ 'pear', 'apple' ]) { 1 }
es_es: when ([ 'pera', 'manzana' ]) { 1 }

source: This document exists to list all of these utilities, explain what they are for and provide pointers to each module's documentation, if appropriate.
es_es: Este documento contiene una descripción de las utilidades y referencias a la documentación de cada módulo (si existe).

source: will test only the regex, which causes both operands to be treated as boolean.
es_es: pondrá a prueba sólo la expresión regular, lo que hace que ambos operandos sean tratados como booleanos.

source: Imagine you'd like to match everything between "foo" and "bar".
es_es: Imagínese que quisiera buscar todo lo que hay entre "mesa" y "come".

source: You can now weaken references to read only values.
es_es: Ahora puede debilitar referencias para leer solo valores.

# print STDERR "stderr 1 "; # subprocesses too
source: print STDERR "stderr 1\n"; # subprocesses too
es_es: print STDERR "stderr 1\n"; # también para subprocesos

source: See the Fcntl module or your fcntl(2) manpage to learn what functions are available on your system.
es_es: Ver el módulo Fcntl o la página de manual fcntl(2) para aprender qué funciones están disponibles en su sistema.

source: As a side-effect, no longer refuses to startup when run by root.
es_es: Como efecto colateral, ya no se niega a iniciarse cuando se ejecuta como el usuario root.

source: Replace C<5.14.2> with your respective version of Perl.
es_es: Reemplace C<5.14.2> con su respectiva versión de Perl.

source: The comp.lang.perl.* newsgroups and several of the mailing lists provide free answers to your questions in near real-time.
es_es: Los grupos de noticias comp.lang.perl.* y varias listas de correo ofrecen respuestas a sus preguntas de forma gratuita y casi en tiempo real.

source: If you're planning to filetest the return values out of a C<readdir>, you'd better prepend the directory in question.
es_es: Si está planeando hacer test de archivos de los valores retornados por un C<readdir>, más le vale anteponer el directorio en cuestión.

source: 2254 Pthread library fixes
es_es: 2254 Pthread arreglos en biblioteca

source: If FILEHANDLE is omitted, assumes the file last read.
es_es: Si IDENTIFICADOR_ARCHIVO se omite, se asume que es el último archivo leído.

source: (Perl emulates the system call by remembering the status values of processes that have exited but have not been harvested by the Perl script yet.)
es_es: (Perl emula la llamada al sistema, recordando los valores de estado de los procesos que han salido, pero que todavía no han sido recolectadas por el script Perl).

source: In general, if the number is 255 (0xFF, 0377) or below, Perl interprets this in the platform's native encoding.
es_es: En general, si el número es 255 (0xFF, 0377) o menor, Perl lo interpreta en la codificación nativa de la plataforma.

source: Num numish[4] numeric equality $a == $b
es_es: Número numeral[4] igualdad numérica $a == $b

source: -O File is owned by real uid.
es_es: -O Archivo es propiedad del uid real.

source: exec "sort $outfile | uniq";
es_es: exec "sort $salida | uniq";

source: as after matching the A but failing on the B the C<(*THEN)> verb will backtrack and try C; but the C<(*PRUNE)> verb will simply fail.
es_es: porque después de buscar por la A, pero fallando con la B, el verbo C<(*THEN)> dará una vuelta atrás y lo intentará con C; pero el verbo C<(*PRUNE)> simplemente fallará.

source: C<$hints> and C<$bitmask> contain pragmatic hints that the caller was compiled with.
es_es: C<$hints> y C<$bitmask> contienen detalles para los cuales caller fue compilado.

source: See the Cross/README file.
es_es: Vea el archivo Cross/README.

source: If you want all items in C<@ARGV> to be interpreted as file names, you can use the module C<ARGV::readonly> from CPAN.
es_es: Si desea que todos los elementos de C<@ARGV> deban ser interpretados como nombres de archivo, puede utilizar el módulo C<ARGV::readonly> de CPAN.

source: For a discussion of the important changes in this release, see pod/perldelta.pod.
es_es: Para una discusión de los cambios importantes en esta versión, consulte pod/perldelta.pod.

source: In particular, putting a C<use> inside the false branch of a conditional doesn't prevent it from being processed.
es_es: En particular, poniendo un C<use> dentro de la rama falsa de un condicional no impide que sea procesado.

source: For example, C</(?<=\t)\w+/> matches a word that follows a tab, without including the tab in C<$&>.
es_es: Por ejemplo, C</(?<=\t)\w+/> coincide con una palabra seguida por un tabulador, sin incluir el tabulador en C<$&>.

source: Within a pattern, you may designate subpatterns for later reference by enclosing them in parentheses, and you may refer back to the I<n>th subpattern later in the pattern using the metacharacter \I<n> or \gI<n>.
es_es: Dentro de un patrón, puede designar subpatrones para su posterior consulta encerrándolos entre paréntesis, y puede referirse al subpatrón I<n>-ésimo más adelante, en el patrón utilizando el metacarácter \I<n> o \gI<n>.

source: will now (correctly) fail under use strict.
es_es: ahora fallará (correctamente) bajo el uso estricto.

source: If C<A> is a better match for C<S> than C<A'>, C<AB> is a better match than C<A'B'>.
es_es: Si C<A> es una mejor coincidencia para C<S> que C<A'>, C<AB> es una mejor coincidencia que C<A'B'>.

source: ($package, $filename, $line) = caller;
es_es: ($paquete, $nombre_archivo, $linea) = caller;

source: Notably, the ctime field is non-portable.
es_es: En particular, el campo ctime no es portátil.

source: perlsolaris Perl notes for Solaris
es_es: perlsolaris Notas para Solaris

source: unless ( condition ) {
es_es: unless ( condición ) {

source: The external interface is unchanged, and aside from the bug fixes described above, there should be no change in behaviour.
es_es: El interfaz externo no se ha modificado, y aparte de la corrección de errores descritos anteriormente, no debería haber ningún cambio en el comportamiento.

source: C<$wday> is the day of the week, with 0 indicating Sunday and 3 indicating Wednesday.
es_es: C<$sdia> es el día de la semana, con 0 indicando domingo y 3 indicando miércoles.

source: More precisely: the subtests using datagram sockets fail.
es_es: Precisando más: las subpruebas usando sockets de datagramas fallan.

source: Used on numbers, the bitwise operators ("&", "|", "^", "~", "<<", and ">>") always produce integral results.
es_es: Usado en números, los operadores binarios ("&", "|", "^", "~", "<<", y ">>") siempre producen resultados enteros.

source: say "This \Qquoting \ubusiness \Uhere isn't quite\E done yet,\E is it?";
es_es: say "Este \Qtrabajo de \uescapado \Uaún no se ha\E terminado,\E ¿no?";

source: This scalar value is B<not> locale-dependent but is a Perl builtin.
es_es: Este valor escalar B<no> es dependiente de la región, sino que viene de una función interna de Perl.

source: "31"); print $z2[$mday];
es_es: "31"); print $z2[$dmes];

source: Virtually all known and current Unix derivatives are supported (perl's native platform), as are other systems like VMS, DOS, OS/2, Windows, QNX, BeOS, OS X, MPE/iX and the Amiga.
es_es: Es compatible con prácticamente todos los sistemas operativos derivados de Unix (la plataforma nativa de perl) conocidos y actuales, así como con otros sistemas como VMS, DOS, OS/2, Windows, QNX, BeOS, OS X, MPE/iX y Amiga.

source: %days # (key1, val1, key2, val2 ...)
es_es: %dias # (clave1, valor1, clave2, valor2 ...)

source: s/(\w+)/\u\L$1/g; # "titlecase" words
es_es: s/(\w+)/\u\L$1/g; # capitaliza las palabras

source: This last example splits $foo into the first two words and the remainder of the line, and assigns those three fields to $F1, $F2, and $Etc.
es_es: Este último ejemplo divide $foo en las dos primeras palabras y el resto de la línea, y asigna los tres campos a $F1, $F2, y $Etc.

source: Ten years ago it was a dead camel carcass (according to this document).
es_es: Hace diez años era un camello muerto (según este documento).

source: $time = stat($file)[8]; # OOPS, FORGOT PARENTHESES
es_es: $acceso = stat($archivo)[8]; # ¡OOPS!, OLVIDÓ LOS PARÉNTESIS

source: Those constructs are discouraged anyway.)
es_es: Se desaconseja, de todas maneras, usar estas construcciones.)

source: open() or die $!; `$userinput` use.perl.org
es_es: open() or die $!; `$entrada_usuario` use.perl.org

source: Here's a simple example to illustrate the difference between the two range operators:
es_es: He aquí un ejemplo sencillo para ilustrar la diferencia entre los dos operadores rango:

source: In all other regards, "..." behaves just like ".." does.
es_es: En todos los demás aspectos, "..." se comporta como "..".

source: The RE engine scans the string from left to right and converts it to a finite automaton.
es_es: El motor de RE explora la cadena de izquierda a derecha y lo convierte en un autómata finito.

source: say '$foo is the string "foo"';
es_es: say '$foo es la cadena "foo"';

source: printf '<%#X>', 12; # prints "<0XC>"
es_es: printf '<%#X>', 12; # imprime "<0XC>"

source: If the C</d> modifier is specified, any characters specified by SEARCHLIST not found in REPLACEMENTLIST are deleted.
es_es: Si se especifica el modificador C</d>, cualquier carácter especificado por LISTA_BÚSQUEDA que no sea encontrado en la LISTA_REEMPLAZO es eliminado.

source: (See C<getpriority(2)>.) Will raise a fatal exception if used on a machine that doesn't implement getpriority(2).
es_es: (Ver L<getpriority>). Lanzará una excepción fatal si se usa en una máquina que no implemente getpriority(2).

source: H A hex string (high nybble first).
es_es: H Una cadena hexadecimal (primero el nibble alto).

source: C<(?0)> is an alternate syntax for C<(?R)>.
es_es: C<(?0)> es una sintaxis alternativa para C<(?R)>.

source: You should reopen those to F</dev/null> if it's any issue.
es_es: Deberá reabrirlos a F</dev/null> si eso es un problema.

source: 3]; # array slice
es_es: 3]; # porción array

source: You can also use
es_es: También puede usar

source: by Tony Stubblebine
es_es: Tony Stubblebine
